tap "farion1231/ccswitch"
tap "nikitabobko/tap"
brew "bat"
brew "clang-format"
brew "cmake"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "node"
brew "markdownlint-cli2"
brew "neovim"
brew "ninja"
brew "openjdk@17"
brew "opencode"
brew "openspec"
brew "pandoc"
brew "pi-coding-agent"
brew "python@3.14"
brew "python-tk@3.14"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "starship"
brew "stylua"
brew "tmux"
brew "uv"
cask "nikitabobko/tap/aerospace"
cask "cc-switch"
cask "clash-verge-rev"
cask "codex-app"
cask "opencode-desktop"
cask "font-maple-mono-nl-nf-cn"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "visual-studio-code"
cask "zed"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "ide-innovation-lab.cangjie"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "openai.chatgpt"
vscode "yzhang.markdown-all-in-one"
