asvetliakov.vscode-neovim
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
davidanson.vscode-markdownlint
esbenp.prettier-vscode
github.copilot-chat
ms-ceintl.vscode-language-pack-zh-hans
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
openai.chatgpt
yzhang.markdown-all-in-one
